cf/Catalogs/ОтчетыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ОтчетыПользователей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаМодификации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИсточникаДанных</Name>
					<Comment>0 - метаданные, 1 - запрос, </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Разрешено</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Запрещено</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Итоги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выражение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппировкиИтога</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группировка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/ОтчетыПользователей/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область Экспортные

&НаСервере
Функция ИзменитьНастройкуОтчетаПользователем(Ссылка, Настройка) Экспорт
	
	Возврат Справочники.ОтчетыПользователей.ИзменитьНастройкуОтчетаПользователем(Ссылка, Настройка);
	
КонецФункции

&НаСервере
Процедура ОбновитьHTML() Экспорт
	
	ОтчетыHTML = Справочники.ОтчетыПользователей.ПолучитьHTMLСпискаОтчетов();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиОтчета(Ссылка) Экспорт
	
	Возврат Новый Структура("ИсточникДанных, АдресНастроек", Ссылка.ИсточникДанных, ПоместитьВоВременноеХранилище(Ссылка.Настройки));
	
КонецФункции

&НаСервере
Функция ПометитьНаУдалениеНаСервере(Ссылка)
	
	Попытка
		
		Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
		
	Исключение
		
		ОбщиеФункции.СообщитьТекст(ОписаниеОшибки());
		Возврат Ложь; КонецПопытки;
	
	Возврат Истина;
	
КонецФункции
&НаКлиенте
Процедура ОбработатьПометкуУдаления(Результат, Параметры) Экспорт
	
	Если 	Результат = КодВозвратаДиалога.Да И
			ПометитьНаУдалениеНаСервере(Параметры) Тогда
			
		ОбновитьHTML() КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПометитьНаУдаление(Ссылка) Экспорт
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ОбработатьПометкуУдаления", ЭтаФорма, Ссылка),"Удалить отчет:" + Ссылка + "?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовыйКомментарий(Ссылка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ДекорацияСоздатьОтчетНажатие(Элемент)
	
	ОткрытьФорму("Справочник.ОтчетыПользователей.ФормаОбъекта");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Слежение.Записать("Отчеты пользователя. Открыл список",,ИмяФормы);
	ОбновитьHTML();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетыHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	HTMLОбработкаКлиент.ТекстHTMLПриНажатии(ДанныеСобытия, СтандартнаяОбработка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	 
	ОбновитьHTML();
	
КонецПроцедуры

&НаКлиенте
Процедура ПростойСправочник(Команда)
	
	ОткрытьФорму("Справочник.ОтчетыПользователей.Форма.ПростойСписок");
	
КонецПроцедуры
